pycom/pycom-micropython-sigfox/esp32/mods/modpycom.c
}


STATIC mp_obj_t mod_pycom_sigfox_info (size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_id, ARG_pac, ARG_public_key, ARG_private_key, ARG_force };
    STATIC const mp_arg_t allowed_args[] = {
            { MP_QSTR_id,           MP_ARG_KW_ONLY  | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
            { MP_QSTR_pac,          MP_ARG_KW_ONLY  | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
            { MP_QSTR_public_key,   MP_ARG_KW_ONLY  | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
            { MP_QSTR_private_key,  MP_ARG_KW_ONLY  | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
            { MP_QSTR_force,        MP_ARG_KW_ONLY  | MP_ARG_BOOL, {.u_bool = false} }
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t id[4];
    uint8_t pac[8];
    uint8_t public_key[16];
    uint8_t private_key[16];

    config_get_sigfox_id(id);
    config_get_sigfox_pac(pac);
    config_get_sigfox_public_key(public_key);
    config_get_sigfox_private_key(private_key);


    if (args[ARG_id].u_obj == mp_const_none && args[ARG_pac].u_obj == mp_const_none && args[ARG_public_key].u_obj == mp_const_none && args[ARG_private_key].u_obj == mp_const_none) {

        mp_obj_tuple_t *t = MP_OBJ_TO_PTR(mp_obj_new_tuple(4, NULL));

        t->items[ARG_id] = is_empty(id, sizeof(id)) ? mp_const_none:mp_obj_new_str((const char*)id, sizeof(id));
        t->items[ARG_pac] = is_empty(pac, sizeof(pac)) ? mp_const_none:mp_obj_new_str((const char*)pac, sizeof(pac));
        t->items[ARG_public_key] = is_empty(public_key, sizeof(public_key)) ? mp_const_none:mp_obj_new_str((const char*)public_key, sizeof(public_key));
        t->items[ARG_private_key] = is_empty(private_key, sizeof(private_key)) ? mp_const_none:mp_obj_new_str((const char*)private_key, sizeof(private_key));

        return MP_OBJ_FROM_PTR(t);

    } else {

        // temporary array to store even the longest value from id, pac, public_key and private_key
        uint8_t tmp_array[16];
        size_t length;
        bool ret_val = false;

        if (args[ARG_id].u_obj != mp_const_none) {

            if ( args[ARG_force].u_bool == true || is_empty(id, sizeof(id)) ) {

                const char* id = mp_obj_str_get_data(args[ARG_id].u_obj, &length);

                if(length != 8) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "ID must have length of 8!"));
                }

                // Put together every 2 characters of the string (which are digits from 0 - 9 and a/A - f/F) into 1 bytes because the available space is half of the required one
                for(int i = 0, j = 0; i < length; i = i+2) {
                    uint8_t lower_nibble = hex_from_char(id[i+1]);
                    uint8_t upper_nibble = hex_from_char(id[i]);

                    if(lower_nibble == 16 || upper_nibble == 16) {
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "ID must only contain hexadecimal digits!"));
                    }

                    tmp_array[j] = lower_nibble | (upper_nibble << 4);
                    j++;
                }

                ret_val = config_set_sigfox_id(tmp_array);
                if (ret_val == false) {
                    return mp_const_false;
                }
            } else {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Use force option to overwrite existing id!"));
            }
        }
        if (args[ARG_pac].u_obj != mp_const_none) {

            if (args[ARG_force].u_bool == true || is_empty(pac, sizeof(pac))) {

                const char* pac = mp_obj_str_get_data(args[ARG_pac].u_obj, &length);

                if(length != 16) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "PAC must have length of 16!"));
                }

                // Put together every 2 characters of the string (which are digits from 0 - 9 and a/A - f/F) into 1 bytes because the available space is half of the required one
                for(int i = 0, j = 0; i < length; i = i+2) {
                    uint8_t lower_nibble = hex_from_char(pac[i+1]);
                    uint8_t upper_nibble = hex_from_char(pac[i]);

                    if(lower_nibble == 16 || upper_nibble == 16) {
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "PAC must only contain hexadecimal digits!"));
                    }

                    tmp_array[j] = lower_nibble | (upper_nibble << 4);
                    j++;
                }

                ret_val = config_set_sigfox_pac(tmp_array);
                if (ret_val == false) {
                    return mp_const_false;
                }
            } else {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Use force option to overwrite existing pac!"));
            }
        }
        if (args[ARG_public_key].u_obj != mp_const_none) {

            if (args[ARG_force].u_bool == true || is_empty(public_key, sizeof(public_key))) {

                const char* public_key = mp_obj_str_get_data(args[ARG_public_key].u_obj, &length);

                if(length != 32) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Public Key must have length of 32!"));
                }

                // Put together every 2 characters of the string (which are digits from 0 - 9 and a/A - f/F) into 1 bytes because the available space is half of the required one
                for(int i = 0, j = 0; i < length; i = i+2) {
                    uint8_t lower_nibble = hex_from_char(public_key[i+1]);
                    uint8_t upper_nibble = hex_from_char(public_key[i]);

                    if(lower_nibble == 16 || upper_nibble == 16) {
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Public Key must only contain hexadecimal digits!"));
                    }

                    tmp_array[j] = lower_nibble | (upper_nibble << 4);
                    j++;
                }

                ret_val = config_set_sigfox_public_key(tmp_array);
                if (ret_val == false) {
                    return mp_const_false;
                }
            } else {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Use force option to overwrite existing public key!"));
            }

